; =====================================
;		HANDCANNONS
; -------------------------------------

[IRI_Handcannon_CV X2WeaponTemplate]
FriendlyName="Foxhound Handcannon"
FriendlyNamePlural="Foxhound Handcannons"
BriefSummary="Handcannons deal devastating damage at close range, but their ammunition is limited."
TacticalText="<Bullet/> Handcannons deal devastating damage at close range, but their ammunition is limited."
AbilityDescName="handcannon"

[IRI_Handcannon_MG X2WeaponTemplate]
FriendlyName="Nace Handcannon"
FriendlyNamePlural="Nace Handcannons"
BriefSummary="Prototyped by bounty hunter and weaponsmith Nick Fox, the Nace Handcannon uses both conventional gunpowder charge and magnetic acceleration coils for a double whammy of destructive power."
TacticalText="Prototyped by bounty hunter and weaponsmith Nick Fox, the Nace Handcannon uses both conventional gunpowder charge and magnetic acceleration coils for a double whammy of destructive power.<br/><Bullet/> Handcannons deal devastating damage at close range, but their ammunition is limited."
AbilityDescName="handcannon"

[IRI_Handcannon_BM X2WeaponTemplate]
FriendlyName="Beam Handcannon"
FriendlyNamePlural="Beam Handcannons"
BriefSummary="The simultaneously brilliant and insane idea of firing a high caliber hollow point bullet through a chamber full of blue hot plasma with the expectation that some of it is going to end up in the bullet's central cavity and will be delivered to the target to deal extreme damage belongs to Robert Rhoades. Just like it sounds, it is completely crazy and there's no way it could ever work. And yet it does."
TacticalText="The simultaneously brilliant and insane idea of firing a high caliber hollow point bullet through a chamber full of blue hot plasma with the expectation that some of it is going to end up in the bullet's central cavity and will be delivered to the target to deal extreme damage belongs to Robert Rhoades. Just like it sounds, it is completely crazy and there's no way it could ever work. And yet it does.<br/><Bullet/> Handcannons deal devastating damage at close range, but their ammunition is limited."
AbilityDescName="handcannon"

[BreakthroughHandcannonDamage X2TechTemplate]
DisplayName="Improved Handcannons"
Summary="Breakthroughs in advanced projectile propellants have allowed us to increase the muzzle energy of our Handcannons without sacrificing weapon's reliability, improving damage output by +1."

; =====================================
;		COVERT ACTION
; -------------------------------------

[IRI_CovertAction_BountyHunterTraining X2CovertActionTemplate]
ActionObjective="Bounty Hunter Training"

[IRI_CovertAction_BountyHunterTraining_Narrative X2CovertActionNarrativeTemplate]
ActionName="Bounty Hunter Training"
ActionPreNarrative="If you have a promising candidate in the way of the cloak and dagger, I can put you in touch with one of our bounty hunters out in the field. Maybe they can be convinced to provide some on-the-job training. Interested?"
ActionPostNarrative="Looks like your trainee has made one hell of an impression. They got some graduation gifts."

[IRI_CovertAction_BountyHunterTraining_Narrative_SK X2CovertActionNarrativeTemplate]
ActionName="Bounty Hunter Training"
ActionPreNarrative="My kind came in contact with one of the Bounty Hunters. Stealth is not our way, but we welcome anyone who stands against the Elders. It is our suggestion that one of your recruits becomes an apprentice for the Bounty Hunter, and learn all of their skills."
ActionPostNarrative="It is always inspiring to see unity in opposition to the Elders' oppression."

[IRI_CovertAction_BountyHunterTraining_Narrative_TM X2CovertActionNarrativeTemplate]
ActionName="Bounty Hunter Training"
ActionPreNarrative="A Bounty Hunter is passing through the territory protected by my followers, and they are offering their services in matters of espionage and assassination... for a price. Perhaps, one of your recruits could stand to benefit from their experience. In the spirit of mutual cooperation, we are willing to cover the compensation requested by the Bounty Hunter."
ActionPostNarrative="We are happy to serve as a conduit for knowledge in the name of our mutual cause."


[IRI_BH_BountyHunterTraining_StaffSlot X2StaffSlotTemplate]
EmptyText="ROOKIE"
BonusText="ON COVERT ACTION"

[IRI_BH_BountyHunterTraining_StaffSlotReward X2RewardTemplate]
DisplayName="Bounty Hunter Training"

[IRI_BH_BountyHunterTraining_CovertActionReward X2RewardTemplate]
DisplayName="Bounty Hunter Training"

[IRI_BountyHunter_GTS_Unlock X2SoldierAbilityUnlockTemplate]
DisplayName="Bounty Hunter: Untraceable"
Summary="If you don't attack for a turn, Nightfall's cooldown is additionally reduced by <Ability:IRI_BH_Untraceable_CooldownReduction/> turn(s)."

; =====================================
;		BOUNTY HUNTER CLASS
; -------------------------------------

[BountyHunter X2SoldierClassTemplate]
DisplayName = "Bounty Hunter"
ClassSummary = "The Bounty Hunter specializes in eliminating priority targets by ambushing them with surprise attacks and explosives."

LeftAbilityTreeTitle = "Raider"
RightAbilityTreeTitle = "Chaser"
+AbilityTreeTitles = "Raider"
+AbilityTreeTitles = "Chaser"
+AbilityTreeTitles = "Hitman"
+AbilityTreeTitles = "XCOM"

;RankNames
;ShortNames

;RankIcons
;RandomNickNames
;RandomNickNames_Female
;RandomNickNames_Male
;PhotoboothSoloBLines_Female
;PhotoboothSoloBLines_Male

+RandomNickNames = "Redrum"
+RandomNickNames = "Huntsman"
+RandomNickNames = "Bloodhound"
+RandomNickNames = "Owl"
+RandomNickNames = "Pathfinder"
+RandomNickNames = "Stalker"
+RandomNickNames = "Hired Gun"
+RandomNickNames = "Undertaker"
+RandomNickNames = "Vampire"
+RandomNickNames = "Outlaw"
+RandomNickNames = "Mercenary"
+RandomNickNames = "Bandit"

+RandomNickNames_Male = "Man in Black"

; =====================================
;		BOUNTY HUNTER CLASS - LWOTC
; -------------------------------------

[LWS_BountyHunter X2SoldierClassTemplate]
DisplayName = "Bounty Hunter"
ClassSummary = "The Bounty Hunter specializes in eliminating priority targets by ambushing them with surprise attacks and explosives."

LeftAbilityTreeTitle = "Raider"
RightAbilityTreeTitle = "Chaser"
+AbilityTreeTitles = "Raider"
+AbilityTreeTitles = "Chaser"
+AbilityTreeTitles = "Hitman"
+AbilityTreeTitles = "XCOM"

;RankNames
;ShortNames

;RankIcons
;RandomNickNames
;RandomNickNames_Female
;RandomNickNames_Male
;PhotoboothSoloBLines_Female
;PhotoboothSoloBLines_Male

+RandomNickNames = "Redrum"
+RandomNickNames = "Huntsman"
+RandomNickNames = "Bloodhound"
+RandomNickNames = "Owl"
+RandomNickNames = "Pathfinder"
+RandomNickNames = "Stalker"
+RandomNickNames = "Hired Gun"
+RandomNickNames = "Undertaker"
+RandomNickNames = "Vampire"
+RandomNickNames = "Outlaw"
+RandomNickNames = "Mercenary"
+RandomNickNames = "Bandit"
+RandomNickNames = "Rogue"

+RandomNickNames_Male = "Man in Black"


